
# ДЗ № 15
# 1. Создайте класс Person, который имеет атрибуты name и age, а также метод greet()
# (выводит приветствие на экран с именем персоны).
# class Person:
#     name = 'Юрий'
#     # age = 28
#     def greet(self):
#      print(f'Добро пожаловать! {Person.name}')
#
# men = Person() # cоздаем объект men  класса Person
# men.greet()

# 2. Создайте класс Car, который имеет атрибуты make, model и year, а также метод get_info()
# (возвращает строку, содержащую информацию о машине).
# class Car:
#     make = None
#     model = None
#     year = None
#
# Mazda = Car()
# Mazda.make = 'Америка'
# Mazda.model = 'cx5'
# Mazda.year = 2012
# def get_data(self,make,model,year):
#        self.make = make
#        self.model = model
#        self.year = year
# def get_info(self):
#  print('Информация о машине:')
#  print(f'Сделана:', {self.make}, 'Модель:', {self.model}, 'Год выпуска:', {self.year})
#
# get_info(Mazda)